server/app/controllers/api/job_types_controller.rb

    def index
        render json: { job_types: JobType.all.as_json(only: %i[id name])}
---
SELECT `job_types`.* FROM `job_types`