server/app/controllers/api/jobseekers_controller.rb

SELECT `job_seekers`.* FROM `job_seekers` WHERE `job_seekers`.`email` = '20030309shinn@gmail.com' LIMIT 1
---
  def create
    existing = JobSeeker.find_by(email: sign_up_params[:email])