server/app/controllers/api/jobseeker_profiles_controller.rb

  def update
    profile = current_api_job_seeker

    if profile.update(profile_params)
---
UPDATE `job_seekers` SET `job_seekers`.`updated_at` = '2025-11-28 07:25:03.974067', `job_seekers`.`first_name` = '太郎', `job_seekers`.`last_name` = '山田' WHERE `job_seekers`.`id` = 2